jfazekas21/blackBird-ESP32-S3/components/JFS/Sample/Driver/NOR/NXP_LPC4322/FS_NOR_HW_SPIFI_LPC4322_SEGGER_QSPIFI_Test_Board.c
/*********************************************************************
*                     SEGGER Microcontroller GmbH                    *
*                        The Embedded Experts                        *
**********************************************************************
*                                                                    *
*       (c) 2003 - 2022  SEGGER Microcontroller GmbH                 *
*                                                                    *
*       www.segger.com     Support: support_emfile@segger.com        *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile * File system for embedded applications               *
*                                                                    *
*                                                                    *
*       Please note:                                                 *
*                                                                    *
*       Knowledge of this file may under no circumstances            *
*       be used to write a similar product for in-house use.         *
*                                                                    *
*       Thank you for your fairness !                                *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile version: V5.18.1                                      *
*                                                                    *
**********************************************************************
----------------------------------------------------------------------
Licensing information
Licensor:                 SEGGER Microcontroller Systems LLC
Licensed to:              Cardinal Detecto, 102 East Daugherty St, Webb City, MO 64870
Licensed SEGGER software: emFile
License number:           FS-00842
License model:            SSL [Single Developer Single Platform Source Code License]
Licensed product:         -
Licensed platform:        Xtensa LX6 (ESP32), Eclipse
Licensed number of seats: 1
----------------------------------------------------------------------
Support and Update Agreement (SUA)
SUA period:               2022-03-24 - 2022-09-24
Contact to extend SUA:    sales@segger.com
-------------------------- END-OF-HEADER -----------------------------

File    : NOR_PHY_SPIFI_NXP_LPC4322_SEGGER_QSPIFI_Test_Board.c
Purpose : Low-level flash driver for NXP SPIFI interface.
Literature:
  [1] UM10503 LPC43xx ARM Cortex-M4/M0 multi-core microcontroller
      (\\fileserver\Techinfo\Company\NXP\MCU\LPC43xx\UserManual_LPC43xx_UM10503_Rev1.90_150218.pdf)
*/

/*********************************************************************
*
*       #include section
*
**********************************************************************
*/
#include "FS.h"

/*********************************************************************
*
*      Defines, configurable
*
**********************************************************************
*/
#define SPIFI_CLK_HZ          60000000uL    // Frequency of the clock supplied to SPIFI unit.
#define SPIFI_DATA_ADDR       0x80000000    // This is the start address of the memory region used by the file system
                                            // to read the data from the serial NOR flash device. The hardware layer
                                            // performs a dummy read from this address when switching to memory mode
                                            // in order to clean the caches. It should be set to the value passed
                                            // as second parameter to FS_NOR_Configure()/FS_NOR_BM_Configure() in FS_X_AddDevices().
#define RESET_DELAY_LOOPS     100000        // Number of software loops to wait for NOR device to reset
#define USE_OS                0             // Enables / disables the interrupt driver operation

/*********************************************************************
*
*       #include section, conditional
*
**********************************************************************
*/
#if USE_OS
  #include "RTOS.h"
  #include "lpc43xx.h"
#endif

/*********************************************************************
*
*       Defines, fixed
*
**********************************************************************
*/

/*********************************************************************
*
*       SPIFI unit
*/
#define SPIFI_BASE_ADDR       0x40003000
#define SPIFI_CTRL            (*(volatile U32*)(SPIFI_BASE_ADDR + 0x00))    // SPIFI control register
#define SPIFI_CMD             (*(volatile U32*)(SPIFI_BASE_ADDR + 0x04))    // SPIFI command register
#define SPIFI_ADDR            (*(volatile U32*)(SPIFI_BASE_ADDR + 0x08))    // SPIFI address register
#define SPIFI_IDATA           (*(volatile U32*)(SPIFI_BASE_ADDR + 0x0C))    // SPIFI intermediate data register
#define SPIFI_CLIMIT          (*(volatile U32*)(SPIFI_BASE_ADDR + 0x10))    // SPIFI cache limit register
#define SPIFI_DATA32          (*(volatile U32*)(SPIFI_BASE_ADDR + 0x14))    // SPIFI data register (32-bit access, 4 bytes at once)
#define SPIFI_DATA16          (*(volatile U16*)(SPIFI_BASE_ADDR + 0x14))    // SPIFI data register (16-bit access, 2 bytes at once)
#define SPIFI_DATA8           (*(volatile U8*) (SPIFI_BASE_ADDR + 0x14))    // SPIFI data register (8-bit access, 1 byte at once)
#define SPIFI_MCMD            (*(volatile U32*)(SPIFI_BASE_ADDR + 0x18))    // SPIFI memory command register
#define SPIFI_STAT            (*(volatile U32*)(SPIFI_BASE_ADDR + 0x1C))    // SPIFI status register

/*********************************************************************
*
*       Clock generation unit
*/
#define CGU_BASE_ADDR         0x40050000
#define IDIVA_CTRL            (*(volatile U32*)(CGU_BASE_ADDR + 0x0048))
#define IDIVB_CTRL            (*(volatile U32*)(CGU_BASE_ADDR + 0x004C))
#define BASE_SPIFI_CLK        (*(volatile U32*)(CGU_BASE_ADDR + 0x0070))

/*********************************************************************
*
*       Clock control unit 1
*/
#define CCU1_BASE_ADDR        0x40051000
#define CLK_SPIFI_CFG         (*(volatile U32*)(CCU1_BASE_ADDR + 0x0300))
#define CLK_SPIFI_STAT        (*(volatile U32*)(CCU1_BASE_ADDR + 0x0304))

/*********************************************************************
*
*       System control unit
*/
#define SCU_BASE_ADDR         0x40086000
#define SFSP3_2               (*(volatile U32*)(SCU_BASE_ADDR + 0x188))     // Pin configuration register for pin P3_2
#define SFSP3_3               (*(volatile U32*)(SCU_BASE_ADDR + 0x18C))     // Pin configuration register for pin P3_3
#define SFSP3_4               (*(volatile U32*)(SCU_BASE_ADDR + 0x190))     // Pin configuration register for pin P3_4
#define SFSP3_5               (*(volatile U32*)(SCU_BASE_ADDR + 0x194))     // Pin configuration register for pin P3_5
#define SFSP3_6               (*(volatile U32*)(SCU_BASE_ADDR + 0x198))     // Pin configuration register for pin P3_6
#define SFSP3_7               (*(volatile U32*)(SCU_BASE_ADDR + 0x19C))     // Pin configuration register for pin P3_7
#define SFSP3_8               (*(volatile U32*)(SCU_BASE_ADDR + 0x1A0))     // Pin configuration register for pin P3_8

/*********************************************************************
*
*       GPIO unit
*/
#define GPIO_BASE_ADDR        0x400F4000
#define GPIO_DIR5             (*(volatile U32*)(GPIO_BASE_ADDR + 0x2014))   // Direction registers port 5
#define GPIO_SET5             (*(volatile U32*)(GPIO_BASE_ADDR + 0x2214))   // Set register for port 5
#define GPIO_CLR5             (*(volatile U32*)(GPIO_BASE_ADDR + 0x2294))   // Clear register for port 5

/*********************************************************************
*
*       SPIFI command register
*/
#define CMD_BITPOS_BIT                0
#define CMD_BITPOS_MASK               0x7uL
#define CMD_BITVAL_BIT                3
#define CMD_BITVAL_MASK               0x1uL
#define CMD_DATALEN_BIT               0
#define CMD_DATALEN_MASK              0x3FFFuL
#define CMD_POLL_BIT                  14
#define CMD_DOUT_BIT                  15
#define CMD_INTLEN_BIT                16
#define CMD_INTLEN_MASK               0x7uL
#define CMD_FIELDFORM_BIT             19
#define CMD_FIELDFORM_ALL_SERIAL      0x0uL
#define CMD_FIELDFORM_QUAD_DUAL_DATA  0x1uL
#define CMD_FIELDFORM_SERIAL_OPCODE   0x2uL
#define CMD_FIELDFORM_ALL_QUAD_DUAL   0x3uL
#define CMD_FRAMEFORM_BIT             21
#define CMD_FRAMEFORM_OPCODE          0x1uL
#define CMD_FRAMEFORM_OPCODE_1BYTE    0x2uL
#define CMD_FRAMEFORM_OPCODE_2BYTES   0x3uL
#define CMD_FRAMEFORM_OPCODE_3BYTES   0x4uL
#define CMD_FRAMEFORM_OPCODE_4BYTES   0x5uL
#define CMD_OPCODE_BIT                24
#define CMD_OPCODE_MASK               0xFFuL

/*********************************************************************
*
*       SPIFI control register
*/
#define CTRL_TIMEOUT_BIT              0
#define CTRL_CSHIGH_BIT               16
#define CTRL_D_PRFTCH_DIS_BIT         21
#define CTRL_MODE3_BIT                23
#define CTRL_INTEN_BIT                22
#define CTRL_PRFTCH_DIS_BIT           27
#define CTRL_DUAL_BIT                 28
#define CTRL_FBCLK_BIT                30

/*********************************************************************
*
*       SPIFI status register
*/
#define STAT_MCINIT_BIT               0
#define STAT_CMD_BIT                  1
#define STAT_RESET_BIT                4
#define STAT_INTRQ_BIT                5

/*********************************************************************
*
*       Misc. defines
*/
#define CGU_IDIV_BIT                  2
#define CGU_AUTOBLOCK_BIT             11
#define CGU_CLK_SEL_BIT               24
#define SFS_MODE_BIT                  0
#define SFS_EPUN_BIT                  4
#define SFS_EHS_BIT                   5
#define SFS_EZI_BIT                   6
#define SFS_ZIF_BIT                   7
#define CLK_STAT_RUN_BIT              0
#define CLK_CFG_RUN_BIT               0
#define NOR_RESET_BIT                 9
#define SPIFI_PRIO                    15

/*********************************************************************
*
*       ASSERT_IS_LOCKED
*/
#if FS_SUPPORT_TEST
  #define ASSERT_IS_LOCKED()                  \
    if (_LockCnt != 1) {                      \
      FS_X_PANIC(FS_ERRCODE_INVALID_USAGE);   \
    }
#else
  #define ASSERT_IS_LOCKED()
#endif

/*********************************************************************
*
*       IF_TEST
*/
#if FS_SUPPORT_TEST
  #define IF_TEST(Expr)       Expr
#else
  #define IF_TEST(Expr)
#endif

/*********************************************************************
*
*      Static data
*
**********************************************************************
*/
#if FS_SUPPORT_TEST
  static U8 _LockCnt = 0;      // Just to test if the Lock()/Unlock function are called correctly.
#endif

/*********************************************************************
*
*      Static code
*
**********************************************************************
*/

/*********************************************************************
*
*       _GetFieldForm
*
*  Function description
*    Determines the value to be stored in the FIELDFORM field
*    of the SPIFI_CMD and SPIFI_MCMD registers. It also returns
*    the value of the SPIFI_CTRL.DUAL field.
*/
static U32 _GetFieldForm(U16 BusWidth, int * pIsDual) {
  U32 FieldForm;
  int IsDual;

  IsDual = 0;
  if (BusWidth == 0x112u) {
    FieldForm = CMD_FIELDFORM_QUAD_DUAL_DATA;   // Data field is dual other fields are serial.
    IsDual    = 1;
  } else if (BusWidth == 0x114u) {
    FieldForm = CMD_FIELDFORM_QUAD_DUAL_DATA;   // Data field is quad other fields are serial.
  } else if (BusWidth == 0x122u) {
    FieldForm = CMD_FIELDFORM_SERIAL_OPCODE;    // Opcode field is serial. Other fields are dual.
    IsDual    = 1;
  } else if (BusWidth == 0x144u) {
    FieldForm = CMD_FIELDFORM_SERIAL_OPCODE;    // Opcode field is serial. Other fields are quad.
  } else if (BusWidth == 0x444u) {
    FieldForm = CMD_FIELDFORM_ALL_QUAD_DUAL;    // Opcode field is serial. Other fields are quad.
  } else {
    FieldForm = CMD_FIELDFORM_ALL_SERIAL;       // All fields of the command are serial.
  }
  if (pIsDual) {
    *pIsDual = IsDual;
  }
  return FieldForm;
}

/*********************************************************************
*
*       _GetFieldFormEx
*
*  Function description
*    Same functionality as _GetFieldForm() with BusWidth not encoded.
*/
static U32 _GetFieldFormEx(U8 BusWidth, int * pIsDual) {
  U32 FieldForm;
  int IsDual;

  IsDual = 0;
  if (BusWidth == 1) {
    FieldForm = CMD_FIELDFORM_ALL_SERIAL;       // All fields of the command are serial.
  } else if (BusWidth == 2) {
    FieldForm = CMD_FIELDFORM_ALL_QUAD_DUAL;    // All fields are dual.
    IsDual = 1;
  } else if (BusWidth == 4) {
    FieldForm = CMD_FIELDFORM_ALL_QUAD_DUAL;    // All fields are quad.
  } else {
    FieldForm = CMD_FIELDFORM_ALL_SERIAL;       // All fields of the command are serial.
  }
  if (pIsDual) {
    *pIsDual = IsDual;
  }
  return FieldForm;
}

/*********************************************************************
*
*       _GetFrameForm
*
*  Function description
*    Determines the value to be stored in the FAMEFORM field
*    of the SPIFI_CMD and SPIFI_MCMD registers.
*/
static U32 _GetFrameForm(unsigned NumBytesAddr) {
  U32 FrameForm;

